'use strict'
/*
    Практика на операции в JavaScript.
    Давайте узнаем сколько секунд в часе. Как известно, в минуте 60 секунд, а часе - 60 минут.
    Следовательно, чтобы найти количество секунд в часе, необходимо 60 умножить на 60:
*/

console.log(60 * 60);


// Задача 1. Найдите количество секунд в сутках.
console.log(60 * 60 * 24);

// Задача 2. Найдите количество секунд в 30 сутках.
console.log(60 * 60 * 24 * 30);

// Задача 3. Найдите количество секунд в году.
console.log(60 * 60 * 24 * 365);

// Задача 4. Найдите количество минут в году.
console.log(60 * 24);

// Задача 5. Найдите количество минут в году.
console.log(60 * 24 * 365);

// Задача 6. Найдите количество байт в мегабайте.
console.log(1 * 1024 * 1024);

// Задача 7. Найдите количество байт в гигабайте.
console.log(1 * 1024 * 1024 * 1024);

// Задача 8. Найдите количество байт в 10 гигабайтах.
console.log(1 * 1024 * 1024 * 1024 * 10)

// Задача 9. Найдите количество байт в терабайте.
console.log(1 * 1024 * 1024 * 1024 * 1024);

// Задача 10. Найдите количество килобайт в терабайте
console.log(1 * 1024 * 1024 * 1024);

