"use strict"
/*
    Математические операции можно производить не только над числами, но и над переменными.
    Сложим, к примеру, значения двух переменных:
 */

let a = 1;
let b = 2;
alert (a + b); // Выведет 3

/*
    Не обязательно сразу выводить результат операций, можно вначале записать его в какую нибудь переменную,
    а уже затем вывести значение этой переменной:
 */

let a1 = 1;
let b1 = 2;
let c1 = a1 + b1; // Запишем сумму в переменную c
alert (c1); // Выведет 3

let a2 = 10;
let b2 = 2;
alert (a2 + b2);
alert (a2 - b2);
alert (a2 * b2);
alert (a2 / b2);

let c = 10;
let d = 5;
let result = c + d;
alert (result);

let a3 = 1;
let b3 = 2;
let c3 = 3;
alert (a3 + b3 + c3);

let a4 = 10;
let b4 = 5;
let c4 = a4 - b4;
let d4 = 7;
let result4 = c4 + d4;
alert (result);